








 # 1) ნამრავლის გამოთვლა: დაწერეთ ალგორითმი,
# რომელიც დაბეჭდავს სიის ყველა ელემენტის ნამრავლს.

# list1 = [1,2,3,4,5,6,7,8,9,10]

# e = 1

# for i in list1:
#     e *= i
 
# print(e)


# 2) უარყოფითი რიცხვების ამოღება: დაწერეთ ალგორითმი, 
# რომელიც მიიღებს მთელ რიცხვთა სიას და ამოიღებს ყველა უარყოფით რიცხვს,
# დაბეჭდავს ახალ სიას ამ ელემენტების გარეშე.

# numbers = [1,2,3,4,5,-1,-2,-3,-4,-5]

# positive_numbers = []

# for i in numbers:
#     if i > 0:
#         positive_numbers.append(i)

# print(positive_numbers)


#3) საშუალოს პოვნა: დაწერეთ ალგორითმი, 
# რომელიც მიიღებს სიას და დააბრუნებს მის საშუალო არითმეტიკულს.

# list2 = [1,2,3,4,5,6,7,8,9,10]

# print(int(sum(list2)) / len(list2))



# 4) შეერთება: დაწერეთ ალგორითმი,
# რომელიც მიიღებს ორ რიცხვთა სიას, გააერთიანებს მათ ერთ სიაში და ამ სახით დაბეჭდავს.

# list1 = [1,1,1,1,1,1,1,1]
# list2 = [2,2,2,2,2,2,2,2]
# combined_lists = []

# for i in list2:
#     list1.append(i)
# combined_lists.append(list1)
# print(combined_lists)


# დუბლიკატების სია: დაწერეთ ალგორითმი,
# რომელიც მიიღებს სიას.
# თქვენ შემდეგ ამ სიის დუბლიკატებს გადაიტანთ ახალ სიაში და დაბეჭდავთ მას.

# list = ["a","b","c",]
# dublicated_lists = []

# for i in range(10):
#     dublicated_lists.append(list)
# print("dublicated lists:" , dublicated_lists)













