# int() ფუნქციის გამოყენებით გარდავქმნათ სხვა ტიპის მნიშვნელობა ინტიჯერად

print(int(5.3) + 5)
print(int("10") - 5)
print(int(11.4))

# str() ფუნქციის გამოყენებით გარდავქმნათ სხვა ტიპის მნიშვნელობა სტრინგად

print(str(5))
print(str(10) + "21")
print(str(3.140) + "10")

# float() ფუნქციის გამოყენებით გარდავქმნათ მნიშვნელობა ათწილად რიცხვათ

print(float("3.14") + 3.1)
print(float(5))

# type() ფუნქციის მეშვეობით გავიგოთ თუ რა ტიპის არის კონკრეტული მნიშვნელობა

print(type("ertivardisferivardi"))
print(type(5))
print(type(3.14))
print(type(3 > 2))